[
  {
    "page_content": "## ASU News: Highlights\n\n**Sun Devil Community**\n\n* **Global Launch at ASU marks 50 years of teaching English and welcoming international students.** Global Launch, celebrating its 50th anniversary this fall, has provided a path to a university degree and a new life for over a million international students.\n* **Coach Hurley honored as hometown hero at Duke University.**\n* **ASU honors veterans and public servants with annual Salute to Service celebration.**\n\n**Environment and Sustainability**\n\n* **ASU Carbon Summit showcases leadership, collaboration, and sustainable carbon solutions.** The second annual Carbon Summit, held October 24-25 at the Student Pavilion, brought together government officials, entrepreneurs, and NGOs to discuss sustainable solutions.\n\n**Arts, Humanities, and Education**\n\n* **ASU ranks No. 1 in 2024 for Teach for America corps members.** Tied with the University of Texas at Austin, ASU outpaces other top universities like UNC, UCLA, and Ohio State.\n* **Edison Awards announces Michael M. Crow as 2025 Achievement Award honoree.**\n\n**Featured Stories**\n\n* **How computer science can supercharge the semiconductor industry.**\n* **2 killer Halloween projects from ASU's monster expert.**\n* **From Scooby-Doo to Vermin: How an ASU alum became a horror movie filmmaker.**\n* **ASU Thrive September 2024: Read more.** \n\n**ASU in the Media**\n\n* **The Associated Press: Biden visits Indian Country and apologizes for the sin of a 150-year boarding school policy.**\n* **Mother Jones: Arizona's future hinges on water, so why isn't it a big campaign issue?**\n* **Phoenix Business Journal: Arizona State selected to support U.S. military's irregular warfare center.**\n\n**Featured Videos**\n\n* **ASU Barrett OConnor Center: Arizona State University's presence in Washington, D.C. amplifies our institutional voice in national conversations.**\n* **The Big Three from Arizona State University: Three news stories highlighted by Arizona State University's Media Relations and Strategic Communications office.**\n* **10 Years of the University Innovation Alliance: The University Innovation Alliance is the leading national coalition of public research universities committed to increasing the number and diversity.** \n\n**Explore Stories by Topic:**\n\n* **Science and Technology**\n* **Arts, Humanities, and Education**\n* **Business and Entrepreneurship**\n* **Health and Medicine**\n* **Environment and Sustainability**\n* **Local, National, and Global Affairs**\n* **Sun Devil Community**\n* **Sports**\n* **University News** \n",
    "metadata": { "url": "https://news.asu.edu/" }
  }
]
